video_system/core_onvif/onvifreceive/GetServicesResponse_nvr.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xop="http://www.w3.org/2004/08/xop/include"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:tns="http://schemas.xmlsoap.org/ws/2005/04/discovery"
    xmlns:dn="http://www.onvif.org/ver10/network/wsdl"
    xmlns:wsa5="http://www.w3.org/2005/08/addressing">
    <SOAP-ENV:Header>
        <wsd-AppSequence MessageNumber="10291" InstanceId="1"></wsd-AppSequence>
        <wsa:MessageID>urn:uuid:00010010-0001-1020-8000-48ea631bae10</wsa:MessageID>
        <wsa:RelatesTo>uuid:9e11619b-65e2-4628-ba77-2602338e38f3}</wsa:RelatesTo>
        <wsa:To SOAP-ENV:mustUnderstand="true">urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To>
        <wsa:Action SOAP-ENV:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches</wsa:Action>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <tns:ProbeMatches>
            <tns:ProbeMatch>
                <wsa:EndpointReference>
                    <wsa:Address>urn:uuid:00010010-0001-1020-8000-48ea631bae10</wsa:Address>
                </wsa:EndpointReference>
                <tns:Types>dn:NetworkVideoTransmitter</tns:Types>
                <tns:Scopes>onvif://www.onvif.org/Profile/Streaming onvif://www.onvif.org/type/video_encoder  onvif://www.onvif.org/type/ptz  onvif://www.onvif.org/type/audio_encoder  onvif://www.onvif.org/location/  onvif://www.onvif.org/name/IMCP  onvif://www.onvif.org/macaddr/48ea631bae10  onvif://www.onvif.org/version/IPC_2401DE_2421DE_34X1DE_54X1DE_5421DH_24X1SCF-B5265P13  onvif://www.onvif.org/serial/210235C1MCA158001067  onvif://www.onvif.org/hardware/HIC5421S-C  onvif://www.onvif.org/type/IPC  onvif://www.onvif.org/register_status/offline  onvif://www.onvif.org/register_server/0.0.0.0:5060  onvif://www.onvif.org/regist_id/1B-AE-10  </tns:Scopes>
                <tns:XAddrs>http://192.168.0.15:81/onvif/device_service</tns:XAddrs>
                <tns:MetadataVersion>1</tns:MetadataVersion>
            </tns:ProbeMatch>
        </tns:ProbeMatches>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
<?xml version="1.0" encoding="utf-8" standalone="yes" ?>
<s:Envelope
    xmlns:sc="http://www.w3.org/2003/05/soap-encoding"
    xmlns:s="http://www.w3.org/2003/05/soap-envelope"
    xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
    xmlns:tt="http://www.onvif.org/ver10/schema"
    xmlns:tan="http://www.onvif.org/ver20/analytics/wsdl"
    xmlns:timg="http://www.onvif.org/ver20/imaging/wsdl"
    xmlns:trt="http://www.onvif.org/ver10/media/wsdl"
    xmlns:tr2="http://www.onvif.org/ver20/media/wsdl"
    xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl"
    xmlns:tev="http://www.onvif.org/ver10/events/wsdl"
    xmlns:tmd="http://www.onvif.org/ver10/deviceIO/wsdl">
    <s:Header/>
    <s:Body>
        <tds:GetServicesResponse>
            <tds:Service>
                <tds:Namespace>http://www.onvif.org/ver10/device/wsdl</tds:Namespace>
                <tds:XAddr>http://192.168.0.101/onvif/device_service</tds:XAddr>
                <tds:Capabilities>
                    <tds:Capabilities>
                        <tds:Network IPFilter="false" ZeroConfiguration="false" IPVersion6="false" DynDNS="false" Dot11Configuration="false" Dot1XConfigurations="0" HostnameFromDHCP="false" NTP="1" DHCPv6="false"/>
                        <tds:Security TLS1.0="false" TLS1.1 ="false" TLS1.2="false" OnboardKeyGeneration="false" AccessPolicyConfig="false" DefaultAccessPolicy="true" Dot1X="false" RemoteUserHandling="false" X.509Token="false" SAMLToken="false" KerberosToken="false" UsernameToken="true" HttpDigest="true" RELToken="false" SupportedEAPMethods="0" MaxUsers="20" MaxUserNameLength="31" MaxPasswordLength="32"/>
                        <tds:System DiscoveryResolve="false" DiscoveryBye="true" RemoteDiscovery="false" SystemBackup="false" SystemLogging="true" FirmwareUpgrade="true" HttpFirmwareUpgrade="true" HttpSystemBackup="false" HTTPSystemLogging="false" HTTPSupportInformation="false" StorageConfiguration="false" MaxStorageConfigurations="0" GeoLocationEntries="0"/>
                    </tds:Capabilities>
                </tds:Capabilities>
                <tds:Version>
                    <tt:Major>20</tt:Major>
                    <tt:Minor>06</tt:Minor>
                </tds:Version>
            </tds:Service>
            <tds:Service>
                <tds:Namespace>http://www.onvif.org/ver20/analytics/wsdl</tds:Namespace>
                <tds:XAddr>http://192.168.0.101/onvif/analytics_service</tds:XAddr>
                <tds:Capabilities>
                    <tan:Capabilities RuleSupport="true" AnalyticsModuleSupport="true" CellBasedSceneDescriptionSupported="false" RuleOptionsSupported="true" AnalyticsModuleOptionsSupported="false"/>
                </tds:Capabilities>
                <tds:Version>
                    <tt:Major>20</tt:Major>
                    <tt:Minor>06</tt:Minor>
                </tds:Version>
            </tds:Service>
            <tds:Service>
                <tds:Namespace>http://www.onvif.org/ver20/imaging/wsdl</tds:Namespace>
                <tds:XAddr>http://192.168.0.101/onvif/imaging_service</tds:XAddr>
                <tds:Capabilities>
                    <timg:Capabilities ImageStabilization="false" Presets="false"/>
                </tds:Capabilities>
                <tds:Version>
                    <tt:Major>19</tt:Major>
                    <tt:Minor>06</tt:Minor>
                </tds:Version>
            </tds:Service>
            <tds:Service>
                <tds:Namespace>http://www.onvif.org/ver10/media/wsdl</tds:Namespace>
                <tds:XAddr>http://192.168.0.101/onvif/media_service</tds:XAddr>
                <tds:Capabilities>
                    <trt:Capabilities SnapshotUri="true" Rotation="false" VideoSourceMode="false" OSD="true" TemporaryOSDText="false" EXICompression="false">
                        <trt:ProfileCapabilities MaximumNumberOfProfiles="36"/>
                        <trt:StreamingCapabilities RTPMulticast="false" RTP_TCP="true" RTP_RTSP_TCP="true" NonAggregateControl="false" NoRTSPStreaming="false"/>
                    </trt:Capabilities>
                </tds:Capabilities>
                <tds:Version>
                    <tt:Major>20</tt:Major>
                    <tt:Minor>06</tt:Minor>
                </tds:Version>
            </tds:Service>
            <tds:Service>
                <tds:Namespace>http://www.onvif.org/ver20/media/wsdl</tds:Namespace>
                <tds:XAddr>http://192.168.0.101/onvif/media2_service</tds:XAddr>
                <tds:Capabilities>
                    <tr2:Capabilities SnapshotUri="true" Rotation="false" VideoSourceMode="false" OSD="true" TemporaryOSDText="false" Mask="false" SourceMask="true">
                        <tr2:ProfileCapabilities MaximumNumberOfProfiles="36" ConfigurationsSupported="VideoSource VideoEncoder AudioSource AudioEncoder AudioOutput AudioDecoder Metadata Analytics PTZ"/>
                        <tr2:StreamingCapabilities RTSPStreaming="true" RTPMulticast="true" RTP_RTSP_TCP="true" NonAggregateControl="false" AutoStartMulticast="false"/>
                    </tr2:Capabilities>
                </tds:Capabilities>
                <tds:Version>
                    <tt:Major>20</tt:Major>
                    <tt:Minor>06</tt:Minor>
                </tds:Version>
            </tds:Service>
            <tds:Service>
                <tds:Namespace>http://www.onvif.org/ver20/ptz/wsdl</tds:Namespace>
                <tds:XAddr>http://192.168.0.101/onvif/ptz_service</tds:XAddr>
                <tds:Capabilities>
                    <tptz:Capabilities EFlip="false" Reverse="false" GetCompatibleConfigurations="true" MoveStatus="true" StatusPosition="true"/>
                </tds:Capabilities>
                <tds:Version>
                    <tt:Major>18</tt:Major>
                    <tt:Minor>12</tt:Minor>
                </tds:Version>
            </tds:Service>
            <tds:Service>
                <tds:Namespace>http://www.onvif.org/ver10/events/wsdl</tds:Namespace>
                <tds:XAddr>http://192.168.0.101/onvif/event_service</tds:XAddr>
                <tds:Capabilities>
                    <tev:Capabilities WSSubscriptionPolicySupport="true" WSPullPointSupport="true" WSPausableSubscriptionManagerInterfaceSupport="false" MaxNotificationProducers="10" MaxPullPoints="5" PersistenNotificationStorage="false"/>
                </tds:Capabilities>
                <tds:Version>
                    <tt:Major>20</tt:Major>
                    <tt:Minor>06</tt:Minor>
                </tds:Version>
            </tds:Service>
            <tds:Service>
                <tds:Namespace>http://www.onvif.org/ver10/deviceIO/wsdl</tds:Namespace>
                <tds:XAddr>http://192.168.0.101/onvif/deviceIO_service</tds:XAddr>
                <tds:Capabilities>
                    <tmd:Capabilities VideoSources="3" VideoOutputs="1" AudioSources="3" AudioOutputs="1" RelayOutputs="0" SerialPorts="1" DigitalInputs="0" DigitalInputOptions="false"/>
                </tds:Capabilities>
                <tds:Version>
                    <tt:Major>19</tt:Major>
                    <tt:Minor>06</tt:Minor>
                </tds:Version>
            </tds:Service>
        </tds:GetServicesResponse>
    </s:Body>
</s:Envelope>